export const AboutUsCollection = [
    {
        imgURL: "/icons/about_icon_01.png",
        title: "Новый приват",
        description: "Мы ввели систему временного привата, которая поддерживает активность игроков и делает исследование мира еще более захватывающим. Но будьте осторожны — при длительном отсутствии ваши земли могут достаться новым искателям приключений.",
    },
    {
        imgURL: "/icons/about_icon_02.png",
        title: "Сплиф-Арена",
        description: "Возрожденная классическая игра на выживание, которая приносит дух соревнований на новый уровень. Здесь каждый бой — это эпическое сражение, где победитель получает не только лавры, но и ценные награды.",
    },
    {
        imgURL: "/icons/about_icon_03.png",
        title: "Опасные данжи",
        description: "Наши уникальные данжи предлагают испытания для настоящих мастеров. В глубинах этих подземелий скрываются древние сокровища и артефакты, которые смогут добыть только самые смелые.",
    },
    {
        imgURL: "/icons/about_icon_04.png",
        title: "Экономика",
        description: "На нашем сервере вы сами создаёте экономику! У каждого есть возможность открыть свой собственный магазин. Здесь каждый ресурс ценен, так что ваша торговля может повлиять на весь мир!",
    },
    {
        imgURL: "/icons/about_icon_05.png",
        title: "Новый контент",
        description: "Специально для вас мы разработали оригинальные квесты и достижения. Выполняйте их, чтобы получить особые награды и ресурсы, которые помогут вам в игре.",
    },
    {
        imgURL: "/icons/about_icon_06.png",
        title: "Без вайпов",
        description: "Погружайтесь в мир бесконечных возможностей: развивайтесь, стройте уникальные сооружения, соревнуйтесь с друзьями и воплощайте свои самые смелые творческие идеи на нашем сервере.",
    },
  ]
  