export const navLinks = [
    {
        links: [
            { label: "Обзор", href: "/" },
            { label: "Помощь", href: "help" },
            { label: "Правила", href: "rules" },
            { label: "Магазин", href: "shop" },
        ],
    },
];

export const GalleryCollection = [
  {
    imgURL: "/images/gallery-01.png",
  },
  {
    imgURL: "/images/gallery-02.png",
  },
  {
    imgURL: "/images/gallery-03.png",
  },
  {
    imgURL: "/images/gallery-04.png",
  },
  {
    imgURL: "/images/gallery-05.png",
  },
  {
    imgURL: "/images/gallery-06.png",
  },
  {
    imgURL: "/images/gallery-07.png",
  },
  {
    imgURL: "/images/gallery-08.png",
  },
  {
    imgURL: "/images/gallery-09.png",
  },
  {
    imgURL: "/images/gallery-10.png",
  },
  {
    imgURL: "/images/gallery-11.png",
  },
  {
    imgURL: "/images/gallery-12.png",
  },
]

export const AboutUsCollection = [
  {
      imgURL: "/icons/about_icon_01.png",
      title: "Новый приват",
      description: "Мы ввели систему временного привата, которая поддерживает активность игроков и делает исследование мира еще более захватывающим. Но будьте осторожны — при длительном отсутствии ваши земли могут достаться новым искателям приключений.",
  },
  {
      imgURL: "/icons/about_icon_02.png",
      title: "Сплиф-Арена",
      description: "Возрожденная классическая игра на выживание, которая приносит дух соревнований на новый уровень. Здесь каждый бой — это эпическое сражение, где победитель получает не только лавры, но и ценные награды.",
  },
  {
      imgURL: "/icons/about_icon_03.png",
      title: "Опасные данжи",
      description: "Наши уникальные данжи предлагают испытания для настоящих мастеров. В глубинах этих подземелий скрываются древние сокровища и артефакты, которые смогут добыть только самые смелые.",
  },
  {
      imgURL: "/icons/about_icon_04.png",
      title: "Экономика",
      description: "На нашем сервере вы сами создаёте экономику! У каждого есть возможность открыть свой собственный магазин. Здесь каждый ресурс ценен, так что ваша торговля может повлиять на весь мир!",
  },
  {
      imgURL: "/icons/about_icon_05.png",
      title: "Новый контент",
      description: "Специально для вас мы разработали оригинальные квесты и достижения. Выполняйте их, чтобы получить особые награды и ресурсы, которые помогут вам в игре.",
  },
  {
      imgURL: "/icons/about_icon_06.png",
      title: "Без вайпов",
      description: "Погружайтесь в мир бесконечных возможностей: развивайтесь, стройте уникальные сооружения, соревнуйтесь с друзьями и воплощайте свои самые смелые творческие идеи на нашем сервере.",
  },
]

export const FAQCollection = [
  {
    title: "Игровые проблемы.",
    faqs: [
      {
        question: "Вас несправедливо наказали?",
        answer: "В данном случае вы можете подать заявку в группе VK или в Discord в разделе «Обжалование наказаний». В заявке обязательно укажите ник того, кто выдал наказание, приложите скриншот, подтверждающий вашу невиновность, и кратко опишите ситуацию.",
      },
      {
        question: "Заметили нарушение правил игроками?",
        answer: "Вы можете обратиться к администрации сервера напрямую или подать заявку в разделе «Жалобы на игроков». Укажите никнейм нарушителя, приложите скриншот или видео с фиксацией нарушения и кратко опишите ситуацию.",
      },
      {
        question: "Заметили нарушение правил администрацией?",
        answer: "В таком случае вы можете оставить заявку в разделе «Жалобы на персонал», создать тему, указать ник нарушителя, приложить скриншот или видео с фиксацией нарушения.",
      },
    ],
  },
  {
    title: "Проблемы с платными услугами или баги.",
    faqs: [
      {
        question: "Я осуществил покупку, но она не произошла. Что делать?",
        answer: "В таком случае вам следует обратиться непосредственно к Администрации с данными об транзакции.",
      },
      {
        question: "Я нашёл ошибку на сервере. Что делать?",
        answer: "Если вы обнаружили ошибку, не влияющую на безопасность сервера и игроков, сообщите о ней в соответствующий раздел в дискорде. Если же вы обнаружили критическую уязвимость на сервере, то сообщите Администрации лично.",
      },
    ],
  },
  {
    title: "Хочу быть частью вашей команды.",
    faqs: [
      {
        question: "Как стать модератором?",
        answer: "Прежде чем стать модератором, нужно какое-то время побыть хелпером. Подать заявку можно на сайте в личном кабинете. Но чаще всего мы отбираем наиболее активных и ответственных игроков на сервере, обращаясь к ним с предложением присоединиться к нашей команде.",
      },
      {
        question: "Как стать билдером?",
        answer: "Вы можете прислать пример своих построек в соответствующий раздел в заявке на сайте. Если вы подходите на эту роль, то с вами свяжутся.",
      },
      {
        question: "Как стать разработчиком?",
        answer: "Если вы обладаете какими-то уникальными навыками или значительным опытом разработки проектов на Java или у вас есть большой опыт работы с плагинами то, напишите о себе как можно подробнее в группу, мы рассмотрим вашу кандидатуру и дадим обратную связь.",
      },
    ],
  },
  {
    title: "Остались вопросы?",
    faqs: [
      {
        question: "",
        answer: "Вы всегда можете обратиться за помощью в группу Discord в раздел «Помощь».",
      },
    ],
  },
];


export const RulesCollection = [
  {
    title: "1. Общие правила",
  },
  {
    rule: "1.1. Незнание правил не освобождает от ответственности. Игроки обязаны соблюдать все указанные ниже нормы поведения.",
  },
  {
    rule: "1.2. Запрещено использование читов, дюпов и любых программ, дающих игровое преимущество. Нарушители будут забанены на срок от 7 до 365 дней.",
  },
  {
    rule: "1.3. Любой контент, нарушающий законы или моральные нормы (включая материалы 18+), запрещен. Наказание: бан на 30 дней.",
  },
  {
    title: "2. Поведение игроков",
  },
  {
    rule: "2.1. Обман администрации или других игроков строго запрещен. Любая попытка мошенничества приведет к бану на 7 дней.",
  },
  {
    rule: "2.2. Баги и уязвимости должны быть немедленно сообщены администрации. Использование багов для получения преимущества наказывается баном на срок от 7 до 365 дней и конфискацией добытых ресурсов.",
  },
  {
    rule: "2.3. Запрещено использование оскорбительных ников или аватаров. Первое нарушение приведет к предупреждению, повторное — к блокировке аккаунта.",
  },
  {
    title: "3. Защита сервера",
  },
  {
    rule: "3.1. Любые действия, направленные на разрушение сервера (например, взлом или DDoS-атаки), приведут к пожизненному бану по IP.",
  },
  {
    rule: "3.2. Один игрок может иметь не более 3 аккаунтов. Обход блокировок или создание множества аккаунтов приведет к бану по IP на 30 дней.",
  },
  {
    title: "4. Игровой процесс",
  },
  {
    rule: "4.1. Использование автоматизированных инструментов (ботов) запрещено. Нарушители будут забанены на срок от 7 до 365 дней.",
  },
  {
    rule: "4.2. Избыточное размещение блоков или существ, создающих нагрузку на сервер, запрещено. Нарушители получат предупреждение, а при повторных нарушениях — бан на срок от 7 до 365 дней.",
  },
  {
    title: "5. Взаимодействие с другими игроками",
  },
  {
    rule: "5.1. Любые формы агрессии, домогательств или токсичного поведения в адрес игроков запрещены. Наказание: мут или бан, в зависимости от серьёзности.",
  },
  {
    title: "6. Правила чата",
  },
  {
    rule: "6.1. В чате запрещены нецензурные выражения, спам и оскорбления. Наказание: мут или бан в зависимости от серьёзности нарушения.",
  },
  {
    rule: "6.2. Запрещено распространять ложные сведения о сервере или игроках, а также личную информацию без их согласия. Наказание: мут или бан на срок от 30 до 365 дней.",
  },
];
