export const AboutUsCollection = [
  {
      imgURL: "/icons/about_icon_01.png",
      title: "Новый приват",
      description: "Мы ввели систему временного привата, которая поддерживает активность игроков и делает исследование мира еще более захватывающим. Но будьте осторожны — при длительном отсутствии ваши земли могут достаться новым искателям приключений.",
  },
  {
      imgURL: "/icons/about_icon_02.png",
      title: "Сплиф-Арена",
      description: "Возрожденная классическая игра на выживание, которая приносит дух соревнований на новый уровень. Здесь каждый бой — это эпическое сражение, где победитель получает не только лавры, но и ценные награды.",
  },
  {
      imgURL: "/icons/about_icon_03.png",
      title: "Опасные данжи",
      description: "Наши уникальные данжи предлагают испытания для настоящих мастеров. В глубинах этих подземелий скрываются древние сокровища и артефакты, которые смогут добыть только самые смелые.",
  },
  {
      imgURL: "/icons/about_icon_04.png",
      title: "Экономика",
      description: "На нашем сервере вы сами создаёте экономику! У каждого есть возможность открыть свой собственный магазин. Здесь каждый ресурс ценен, так что ваша торговля может повлиять на весь мир!",
  },
  {
      imgURL: "/icons/about_icon_05.png",
      title: "Новый контент",
      description: "Специально для вас мы разработали оригинальные квесты и достижения. Выполняйте их, чтобы получить особые награды и ресурсы, которые помогут вам в игре.",
  },
  {
      imgURL: "/icons/about_icon_06.png",
      title: "Без вайпов",
      description: "Погружайтесь в мир бесконечных возможностей: развивайтесь, стройте уникальные сооружения, соревнуйтесь с друзьями и воплощайте свои самые смелые творческие идеи на нашем сервере.",
  },
]

export const FAQCollection = [
  {
    title: "Игровые проблемы",
    faqs: [
      {
        question: "Вас несправедливо наказали?",
        answer: "Если вы считаете, что получили наказание ошибочно — подайте апелляцию через форму на сайте. Укажите ник администратора, выдавшего наказание, опишите ситуацию и обязательно приложите скриншоты или другие доказательства. Мы всё внимательно рассмотрим.",
      },
      {
        question: "Кто-то нарушает правила?",
        answer: "Если заметили, что игрок ведёт себя неподобающим образом — отправьте жалобу через сайт. Укажите ник нарушителя, приложите доказательства (скрины или видео) и кратко опишите, что произошло. Мы всё проверим и примем меры при необходимости.",
      },
      {
        question: "Нарушения со стороны персонала?",
        answer: "Даже модераторы и админы не выше правил. Если кто-то из команды злоупотребил полномочиями — оставьте жалобу через специальную форму на сайте. Укажите ник, приложите доказательства и опишите ситуацию. Всё будет рассмотрено без предвзятости.",
      },
    ],
  },
  {
    title: "Проблемы с покупками или баги на сервере",
    faqs: [
      {
        question: "Я оплатил покупку, но ничего не пришло. Что делать?",
        answer: "Не переживай! Просто свяжись с Администрацией и укажи данные своей транзакции — мы всё проверим и поможем как можно быстрее.",
      },
      {
        question: "Нашёл баг на сервере — куда писать?",
        answer: "Если баг не критичный и не мешает другим игрокам — напиши о нём в специальный канал баг-репортов в Discord. А вот если ты нашёл серьёзную уязвимость — обязательно сразу сообщи об этом лично Администрации. Безопасность — приоритет!",
      },
    ],
  },
  {
    title: "Хочу быть частью вашей команды.",
    faqs: [
      {
        question: "Как стать разработчиком?",
        answer: "Хочешь разрабатывать фишки для сервера или кастомизировать плагины под уникальные задачи? Если ты шаришь в Java, имеешь опыт в разработке или отлично разбираешься в плагинах и умеешь настраивать их под себя — ты нам точно интересен! Подай заявку в личном кабинете на сайте и расскажи о себе как можно подробнее. Мы обязательно всё прочитаем и свяжемся с тобой.",
      },
      {
        question: "Как стать модератором?",
        answer: "Путь модератора начинается с роли хелпера. После подачи заявки в личном кабинете на сайте тебя ждёт двухнедельный испытательный срок — ты помогаешь игрокам, проявляешь активность, показываешь себя с лучшей стороны. Если всё проходит успешно — добро пожаловать в модераторы!",
      },
      {
        question: "Как стать билдером?",
        answer: "Любишь строить и хочешь внести свой вклад в оформление нашего мира? Отлично! В заявке на сайте прикрепи примеры своих работ — можно скриншоты, видео или даже карту. Мы обязательно посмотрим и, если твой стиль нам подойдёт, обязательно выйдем на связь!",
      },      
    ],
  },
  {
    title: "Остались вопросы?",
    faqs: [
      {
        question: "",
        answer: "Мы всегда рады помочь! Загляните в наш Discord в раздел «Помощь», и мы с удовольствием вам поможем.",
      },
    ],
  },
];

export const RulesCollection = [
  {
    "title": "1. Общие правила"
  },
  {
    "rule": "1.1. Незнание правил не освобождает от ответственности. Игроки обязаны соблюдать все указанные ниже нормы поведения."
  },
  {
    "rule": "1.2. Запрещено использование читов, дюпов и любых программ, дающих игровое преимущество. Нарушители будут забанены на срок от 7 до 365 дней."
  },
  {
    "rule": "1.3. Любой контент, нарушающий законы или моральные нормы (включая материалы 18+), запрещен. Наказание: бан на 30 дней."
  },
  {
    "title": "2. Поведение игроков"
  },
  {
    "rule": "2.1. Обман администрации или других игроков строго запрещен. Любая попытка мошенничества приведет к бану на 7 дней."
  },
  {
    "rule": "2.2. Баги и уязвимости должны быть немедленно сообщены администрации. Использование багов для получения преимущества наказывается баном на срок от 7 до 365 дней и конфискацией добытых ресурсов."
  },
  {
    "rule": "2.3. Запрещено использование оскорбительных ников или аватаров. Первое нарушение приведет к предупреждению, повторное — к блокировке аккаунта."
  },
  {
    "title": "3. Защита сервера"
  },
  {
    "rule": "3.1. Любые действия, направленные на разрушение сервера (например, взлом или DDoS-атаки), приведут к пожизненному бану по IP."
  },
  {
    "rule": "3.2. Один игрок может иметь не более 3 аккаунтов. Обход блокировок или создание множества аккаунтов приведет к бану по IP на 30 дней."
  },
  {
    "title": "4. Игровой процесс"
  },
  {
    "rule": "4.1. Использование автоматизированных инструментов (ботов) запрещено. Нарушители будут забанены на срок от 7 до 365 дней."
  },
  {
    "rule": "4.2. Избыточное размещение блоков или существ, создающих нагрузку на сервер, запрещено. Нарушители получат предупреждение, а при повторных нарушениях — бан на срок от 7 до 365 дней."
  },
  {
    "title": "5. Взаимодействие с другими игроками"
  },
  {
    "rule": "5.1. Любые формы агрессии, домогательств или токсичного поведения в адрес игроков запрещены. Наказание: мут или бан, в зависимости от серьёзности."
  },
  {
    "title": "6. Правила чата"
  },
  {
    "rule": "6.1. В чате запрещены нецензурные выражения, спам и оскорбления. Наказание: мут или бан в зависимости от серьёзности нарушения."
  },
  {
    "rule": "6.2. Запрещено распространять ложные сведения о сервере или игроках, а также личную информацию без их согласия. Наказание: мут или бан на срок от 30 до 365 дней."
  },
  {
    "title": "7. Жалобы и обжалования"
  },
  {
    "rule": "7.1. Если считаете, что вас наказали несправедливо — подайте заявку на сайте или в Discord. С приложением доказательств."
  },
  {
    "rule": "7.2. Жалобы на игроков и персонал подаются через сайт или Discord. Указывайте ники и прикладывайте скриншоты/видео."
  },
  {
    "rule": "7.3. Попытки массового давления на администрацию (рейды, провокации и т.п.) приведут к бану всех участников."
  },
  {
    "title": "8. Донат и платные услуги"
  },
  {
    "rule": "8.1. После покупки доната или товара проверьте, пришло ли всё в течение 5 минут. Нет? — пишите администрации."
  },
  {
    "rule": "8.2. Возврат средств возможен только в случае технической ошибки. Любые попытки обмана — бан."
  },
  {
    "rule": "8.3. Передача донат-привилегий между аккаунтами не допускается (если не указано иное)."
  },
  {
    "title": "9. Команда сервера"
  },
  {
    "rule": "9.1. Уважайте работу модераторов и хелперов. Оскорбления в их адрес — мут или бан."
  },
  {
    "rule": "9.2. Использовать теги [Модер], [Админ], [Dev] и т.п. в никах запрещено. Будет выдано предупреждение или переименование."
  },
  {
    "rule": "9.3. Попытки обмануть персонал (например, при обжаловании наказания) — бан до 30 дней."
  },
  {
    "title": "10. Прочее"
  },
  {
    "rule": "10.1. Запрещено рекламировать другие сервера, проекты или каналы без разрешения. Бан до 30 дней."
  },
  {
    "rule": "10.2. Никакого самовольного PvP в зонах, где это запрещено. Нарушение — варн или бан."
  },
  {
    "rule": "10.3. Использование серверных ресурсов в корыстных целях (например, для майнинга или крипты) — перманентный бан."
  }
];
